blog/ExpressJS/intro.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-26 Thu 22:42 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>What is the ExpressJS framework?</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Introduction to the Express framework"
>
<meta name="keywords" content="Express JavaScript webserver">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">What is the ExpressJS framework?</h1>
<p class="subtitle">An introduction to the Express framework</p>
</header><p>
Express is a small, unopinionated framework for handling web functionality in Node.js applications. One of the main reasons to use the Express framework is the abstractions it offers in terms of built-in functionality&#x2026;
</p>

<p>
In a pure Node.js app using the http module, a web application will require a web server to be manually built, including the ability to route requests to different URLs with different request methods, and potentially parameters or bodies of data. This is a rather cumbersome process that has been done many times before, instead of reinventing the wheel we can use Express to provide this core functionality.
</p>

<hr>
<div id="outline-container-org208acfc" class="outline-2">
<h2 id="org208acfc">Creating a simple Express app</h2>
<div class="outline-text-2" id="text-org208acfc">
<p>
To create an Express app, first initialise an npm project and then run <code>npm i express</code> in the project root.
</p>

<p>
Then, inside your index.js file (or other file if main is set differently), type the following:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">express</span> = require(<span style="font-style: italic;">'express'</span>);

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">port</span> = 3000;
<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">app</span> = express();

app.get(<span style="font-style: italic;">'/'</span>, (req, res) =&gt; {
    res.send(<span style="font-style: italic;">'Hello world'</span>);
});

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">server</span> = app.listen(port, () =&gt; {
    console.log(<span style="font-style: italic;">`Server up on ${server.address().address}:${port}`</span>);
});
</pre>
</div>

<ul class="org-ul">
<li>The first line imports the <code>express</code> module.</li>
<li>Line 3 creates a variable for the port number whilst line 4 creates an instance of <code>Express</code> using the <code>express()</code> top-level function.</li>
<li>Line 6 uses the <code>get()</code> method to register a HTTP GET route to the URL path <code>'/'</code>, it takes a callback as the second parameter that accepts the request and response objects used in the node.js http module.</li>
<li>Line 7 is the response to send when a request is sent to <code>http://localhost:3000/</code></li>
<li>Line 10 then tells the express application to start listening for requests on the specified port (random if omitted), the supplied callback to <code>app.listen()</code> runs when the server has started. <code>app.listen()</code> returns an instance of <code>http.Server</code></li>
</ul>

<p>
It is important to note that if a method that accepts a request does not terminate the request-response cycle through the use of a method like <code>res.send()</code>, the cycle hangs&#x2026;
</p>
</div>
</div>

<div id="outline-container-org3ce3ca2" class="outline-2">
<h2 id="org3ce3ca2">Apply the morgan logging middleware</h2>
<div class="outline-text-2" id="text-org3ce3ca2">
<p>
The <code>morgan</code> logger can be passed as middleware to Express for logging the requests automatically. Add the dependency to your project with <code>npm i morgan</code> and then do the following to add it as middleware to your express app:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">express</span> = require(<span style="font-style: italic;">'express'</span>);
<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">morgan</span> = require(<span style="font-style: italic;">'morgan'</span>);

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">port</span> = 3000;
<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">app</span> = express();

app.use(morgan(<span style="font-style: italic;">'dev'</span>));

app.get(<span style="font-style: italic;">'/'</span>, (req, res) =&gt; {
    res.send(<span style="font-style: italic;">'Hello world'</span>);
});

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">server</span> = app.listen(port, () =&gt; {
    console.log(<span style="font-style: italic;">`Server up on ${server.address().address}:${port}`</span>);
});
</pre>
</div>

<p>
The most important lines are lines 2 and 7:
</p>

<ul class="org-ul">
<li>Line 2 imports the <code>morgan</code> module</li>
<li>Line 7 specifies the <code>morgan()</code> function to pass a logger as middleware to the <code>use()</code> method of the Express instance</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<footer>
  <p>
    Last updated 2022-05-26 Thu 22:42. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </p>
  <p><small>Copyright 2022 Morgan Walsh.</small></p>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
